{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 64, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d", "trainable": true, "batch_input_shape": [null, 128, 128, 64, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d", "trainable": true, "dtype": "float32", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_5", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_6", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_7", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_8", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_9", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_10", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_11", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_12", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "acc", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": {"class_name": "ExponentialDecay", "config": {"initial_learning_rate": 0.001, "decay_steps": 100000, "decay_rate": 0.96, "staircase": true, "name": null}}, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of123.bin", "group1-shard2of123.bin", "group1-shard3of123.bin", "group1-shard4of123.bin", "group1-shard5of123.bin", "group1-shard6of123.bin", "group1-shard7of123.bin", "group1-shard8of123.bin", "group1-shard9of123.bin", "group1-shard10of123.bin", "group1-shard11of123.bin", "group1-shard12of123.bin", "group1-shard13of123.bin", "group1-shard14of123.bin", "group1-shard15of123.bin", "group1-shard16of123.bin", "group1-shard17of123.bin", "group1-shard18of123.bin", "group1-shard19of123.bin", "group1-shard20of123.bin", "group1-shard21of123.bin", "group1-shard22of123.bin", "group1-shard23of123.bin", "group1-shard24of123.bin", "group1-shard25of123.bin", "group1-shard26of123.bin", "group1-shard27of123.bin", "group1-shard28of123.bin", "group1-shard29of123.bin", "group1-shard30of123.bin", "group1-shard31of123.bin", "group1-shard32of123.bin", "group1-shard33of123.bin", "group1-shard34of123.bin", "group1-shard35of123.bin", "group1-shard36of123.bin", "group1-shard37of123.bin", "group1-shard38of123.bin", "group1-shard39of123.bin", "group1-shard40of123.bin", "group1-shard41of123.bin", "group1-shard42of123.bin", "group1-shard43of123.bin", "group1-shard44of123.bin", "group1-shard45of123.bin", "group1-shard46of123.bin", "group1-shard47of123.bin", "group1-shard48of123.bin", "group1-shard49of123.bin", "group1-shard50of123.bin", "group1-shard51of123.bin", "group1-shard52of123.bin", "group1-shard53of123.bin", "group1-shard54of123.bin", "group1-shard55of123.bin", "group1-shard56of123.bin", "group1-shard57of123.bin", "group1-shard58of123.bin", "group1-shard59of123.bin", "group1-shard60of123.bin", "group1-shard61of123.bin", "group1-shard62of123.bin", "group1-shard63of123.bin", "group1-shard64of123.bin", "group1-shard65of123.bin", "group1-shard66of123.bin", "group1-shard67of123.bin", "group1-shard68of123.bin", "group1-shard69of123.bin", "group1-shard70of123.bin", "group1-shard71of123.bin", "group1-shard72of123.bin", "group1-shard73of123.bin", "group1-shard74of123.bin", "group1-shard75of123.bin", "group1-shard76of123.bin", "group1-shard77of123.bin", "group1-shard78of123.bin", "group1-shard79of123.bin", "group1-shard80of123.bin", "group1-shard81of123.bin", "group1-shard82of123.bin", "group1-shard83of123.bin", "group1-shard84of123.bin", "group1-shard85of123.bin", "group1-shard86of123.bin", "group1-shard87of123.bin", "group1-shard88of123.bin", "group1-shard89of123.bin", "group1-shard90of123.bin", "group1-shard91of123.bin", "group1-shard92of123.bin", "group1-shard93of123.bin", "group1-shard94of123.bin", "group1-shard95of123.bin", "group1-shard96of123.bin", "group1-shard97of123.bin", "group1-shard98of123.bin", "group1-shard99of123.bin", "group1-shard100of123.bin", "group1-shard101of123.bin", "group1-shard102of123.bin", "group1-shard103of123.bin", "group1-shard104of123.bin", "group1-shard105of123.bin", "group1-shard106of123.bin", "group1-shard107of123.bin", "group1-shard108of123.bin", "group1-shard109of123.bin", "group1-shard110of123.bin", "group1-shard111of123.bin", "group1-shard112of123.bin", "group1-shard113of123.bin", "group1-shard114of123.bin", "group1-shard115of123.bin", "group1-shard116of123.bin", "group1-shard117of123.bin", "group1-shard118of123.bin", "group1-shard119of123.bin", "group1-shard120of123.bin", "group1-shard121of123.bin", "group1-shard122of123.bin", "group1-shard123of123.bin"], "weights": [{"name": "conv3d/kernel", "shape": [3, 3, 3, 1, 64], "dtype": "float32"}, {"name": "conv3d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_1/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_10/kernel", "shape": [3, 3, 3, 512, 512], "dtype": "float32"}, {"name": "conv3d_10/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3d_11/kernel", "shape": [3, 3, 3, 512, 512], "dtype": "float32"}, {"name": "conv3d_11/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3d_12/kernel", "shape": [3, 3, 3, 512, 512], "dtype": "float32"}, {"name": "conv3d_12/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3d_2/kernel", "shape": [3, 3, 3, 64, 128], "dtype": "float32"}, {"name": "conv3d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3d_3/kernel", "shape": [3, 3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3d_4/kernel", "shape": [3, 3, 3, 128, 256], "dtype": "float32"}, {"name": "conv3d_4/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3d_5/kernel", "shape": [3, 3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3d_5/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3d_6/kernel", "shape": [3, 3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3d_7/kernel", "shape": [3, 3, 3, 256, 512], "dtype": "float32"}, {"name": "conv3d_7/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3d_8/kernel", "shape": [3, 3, 3, 512, 512], "dtype": "float32"}, {"name": "conv3d_8/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3d_9/kernel", "shape": [3, 3, 3, 512, 512], "dtype": "float32"}, {"name": "conv3d_9/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [16384, 4096], "dtype": "float32"}, {"name": "dense/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [4096, 3], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [3], "dtype": "float32"}]}]}